performance/esb/Round_1-2/wso2esb-1.0/synapse.xml

<syn:definitions xmlns:syn="http://ws.apache.org/ns/synapse"><syn:registry provider="org.wso2.esb.registry.ESBRegistry"><syn:parameter name="root">file:registry/</syn:parameter><syn:parameter name="cachableDuration">15000</syn:parameter></syn:registry><syn:proxy name="Proxy" transports="https http" startOnLoad="true"><syn:target endpoint="simulator"><syn:outSequence><syn:send /></syn:outSequence></syn:target><syn:publishWSDL><wsdl:definitions xmlns:axis2="http://services.samples" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:ns0="http://services.samples/xsd" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:ns1="http://org.apache.axis2/xsd" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://services.samples"><wsdl:documentation>PerfStockQuoteService</wsdl:documentation><wsdl:types><xs:schema xmlns:ns="http://services.samples/xsd" attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://services.samples/xsd"><xs:element name="buyStocks"><xs:complexType><xs:sequence><xs:element name="request" nillable="true" type="ns:BuyStocks" /></xs:sequence></xs:complexType></xs:element><xs:element name="BuyStocks" type="ns:BuyStocks" /><xs:complexType name="BuyStocks"><xs:sequence><xs:element maxOccurs="unbounded" name="orders" nillable="true" type="ns:BuyOrder" /></xs:sequence></xs:complexType><xs:element name="BuyOrder" type="ns:BuyOrder" /><xs:complexType name="BuyOrder"><xs:sequence><xs:element name="buyerId" nillable="true" type="xs:string" /><xs:element name="misc" nillable="true" type="xs:string" /><xs:element name="price" type="xs:double" /><xs:element name="symbol" nillable="true" type="xs:string" /><xs:element name="volume" type="xs:int" /></xs:sequence></xs:complexType><xs:element name="buyStocksResponse"><xs:complexType><xs:sequence><xs:element name="return" nillable="true" type="ns:BuyStocksResponse" /></xs:sequence></xs:complexType></xs:element><xs:element name="BuyStocksResponse" type="ns:BuyStocksResponse" /><xs:complexType name="BuyStocksResponse"><xs:sequence><xs:element maxOccurs="unbounded" name="purchases" nillable="true" type="ns:SoldNote" /></xs:sequence></xs:complexType><xs:element name="SoldNote" type="ns:SoldNote" /><xs:complexType name="SoldNote"><xs:sequence><xs:element name="price" type="xs:double" /><xs:element name="sellerId" nillable="true" type="xs:string" /><xs:element name="symbol" nillable="true" type="xs:string" /><xs:element name="volume" type="xs:int" /></xs:sequence></xs:complexType><xs:element name="getFullQuote"><xs:complexType><xs:sequence><xs:element name="request" nillable="true" type="ns:GetFullQuote" /></xs:sequence></xs:complexType></xs:element><xs:element name="GetFullQuote" type="ns:GetFullQuote" /><xs:complexType name="GetFullQuote"><xs:sequence><xs:element name="symbol" nillable="true" type="xs:string" /></xs:sequence></xs:complexType><xs:element name="getFullQuoteResponse"><xs:complexType><xs:sequence><xs:element name="return" nillable="true" type="ns:GetFullQuoteResponse" /></xs:sequence></xs:complexType></xs:element><xs:element name="GetFullQuoteResponse" type="ns:GetFullQuoteResponse" /><xs:complexType name="GetFullQuoteResponse"><xs:sequence><xs:element maxOccurs="unbounded" name="tradeHistory" nillable="true" type="ns:TradingDay" /></xs:sequence></xs:complexType><xs:element name="TradingDay" type="ns:TradingDay" /><xs:complexType name="TradingDay"><xs:sequence><xs:element name="day" type="xs:int" /><xs:element name="quote" nillable="true" type="ns:GetQuoteResponse" /></xs:sequence></xs:complexType><xs:element name="GetQuoteResponse" type="ns:GetQuoteResponse" /><xs:complexType name="GetQuoteResponse"><xs:sequence><xs:element name="change" type="xs:double" /><xs:element name="earnings" type="xs:double" /><xs:element name="high" type="xs:double" /><xs:element name="last" type="xs:double" /><xs:element name="lastTradeTimestamp" nillable="true" type="xs:string" /><xs:element name="low" type="xs:double" /><xs:element name="marketCap" type="xs:double" /><xs:element name="name" nillable="true" type="xs:string" /><xs:element name="open" type="xs:double" /><xs:element name="peRatio" type="xs:double" /><xs:element name="percentageChange" type="xs:double" /><xs:element name="predictPriceA" type="xs:double" /><xs:element name="predictPriceB" type="xs:double" /><xs:element name="prevClose" type="xs:double" /><xs:element name="sales" type="xs:int" /><xs:element name="symbol" nillable="true" type="xs:string" /><xs:element name="volume" type="xs:int" /><xs:element name="volumeTraded" type="xs:int" /></xs:sequence></xs:complexType><xs:element name="getMarketActivity"><xs:complexType><xs:sequence><xs:element name="request" nillable="true" type="ns:GetMarketActivity" /></xs:sequence></xs:complexType></xs:element><xs:element name="GetMarketActivity" type="ns:GetMarketActivity" /><xs:complexType name="GetMarketActivity"><xs:sequence><xs:element maxOccurs="unbounded" name="symbols" nillable="true" type="xs:string" /></xs:sequence></xs:complexType><xs:element name="getMarketActivityResponse"><xs:complexType><xs:sequence><xs:element name="return" nillable="true" type="ns:GetMarketActivityResponse" /></xs:sequence></xs:complexType></xs:element><xs:element name="GetMarketActivityResponse" type="ns:GetMarketActivityResponse" /><xs:complexType name="GetMarketActivityResponse"><xs:sequence><xs:element maxOccurs="unbounded" name="quotes" nillable="true" type="ns:GetQuoteResponse" /></xs:sequence></xs:complexType><xs:element name="getQuote"><xs:complexType><xs:sequence><xs:element name="request" nillable="true" type="ns:GetQuote" /></xs:sequence></xs:complexType></xs:element><xs:element name="GetQuote" type="ns:GetQuote" /><xs:complexType name="GetQuote"><xs:sequence><xs:element name="symbol" nillable="true" type="xs:string" /></xs:sequence></xs:complexType><xs:element name="getQuoteResponse"><xs:complexType><xs:sequence><xs:element name="return" nillable="true" type="ns:GetQuoteResponse" /></xs:sequence></xs:complexType></xs:element><xs:element name="placeOrder"><xs:complexType><xs:sequence><xs:element name="order" nillable="true" type="ns:PlaceOrder" /></xs:sequence></xs:complexType></xs:element><xs:element name="PlaceOrder" type="ns:PlaceOrder" /><xs:complexType name="PlaceOrder"><xs:sequence><xs:element name="price" type="xs:double" /><xs:element name="quantity" type="xs:int" /><xs:element name="symbol" nillable="true" type="xs:string" /></xs:sequence></xs:complexType></xs:schema></wsdl:types><wsdl:message name="placeOrderMessage"><wsdl:part name="part1" element="ns0:placeOrder" /></wsdl:message><wsdl:message name="getQuoteMessage"><wsdl:part name="part1" element="ns0:getQuote" /></wsdl:message><wsdl:message name="getQuoteResponse"><wsdl:part name="part1" element="ns0:getQuoteResponse" /></wsdl:message><wsdl:message name="getMarketActivityMessage"><wsdl:part name="part1" element="ns0:getMarketActivity" /></wsdl:message><wsdl:message name="getMarketActivityResponse"><wsdl:part name="part1" element="ns0:getMarketActivityResponse" /></wsdl:message><wsdl:message name="buyStocksMessage"><wsdl:part name="part1" element="ns0:buyStocks" /></wsdl:message><wsdl:message name="buyStocksResponse"><wsdl:part name="part1" element="ns0:buyStocksResponse" /></wsdl:message><wsdl:message name="getFullQuoteMessage"><wsdl:part name="part1" element="ns0:getFullQuote" /></wsdl:message><wsdl:message name="getFullQuoteResponse"><wsdl:part name="part1" element="ns0:getFullQuoteResponse" /></wsdl:message><wsdl:portType name="PerfStockQuoteServicePortType"><wsdl:operation name="placeOrder"><wsdl:input xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" message="axis2:placeOrderMessage" wsaw:Action="urn:placeOrder" /></wsdl:operation><wsdl:operation name="getQuote"><wsdl:input xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" message="axis2:getQuoteMessage" wsaw:Action="urn:getQuote" /><wsdl:output message="axis2:getQuoteResponse" /></wsdl:operation><wsdl:operation name="getMarketActivity"><wsdl:input xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" message="axis2:getMarketActivityMessage" wsaw:Action="urn:getMarketActivity" /><wsdl:output message="axis2:getMarketActivityResponse" /></wsdl:operation><wsdl:operation name="buyStocks"><wsdl:input xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" message="axis2:buyStocksMessage" wsaw:Action="urn:buyStocks" /><wsdl:output message="axis2:buyStocksResponse" /></wsdl:operation><wsdl:operation name="getFullQuote"><wsdl:input xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" message="axis2:getFullQuoteMessage" wsaw:Action="urn:getFullQuote" /><wsdl:output message="axis2:getFullQuoteResponse" /></wsdl:operation></wsdl:portType><wsdl:binding name="PerfStockQuoteServiceSOAP11Binding" type="axis2:PerfStockQuoteServicePortType"><soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document" /><wsdl:operation name="placeOrder"><soap:operation soapAction="urn:placeOrder" style="document" /><wsdl:input><soap:body use="literal" /></wsdl:input></wsdl:operation><wsdl:operation name="getQuote"><soap:operation soapAction="urn:getQuote" style="document" /><wsdl:input><soap:body use="literal" /></wsdl:input><wsdl:output><soap:body use="literal" /></wsdl:output></wsdl:operation><wsdl:operation name="getMarketActivity"><soap:operation soapAction="urn:getMarketActivity" style="document" /><wsdl:input><soap:body use="literal" /></wsdl:input><wsdl:output><soap:body use="literal" /></wsdl:output></wsdl:operation><wsdl:operation name="buyStocks"><soap:operation soapAction="urn:buyStocks" style="document" /><wsdl:input><soap:body use="literal" /></wsdl:input><wsdl:output><soap:body use="literal" /></wsdl:output></wsdl:operation><wsdl:operation name="getFullQuote"><soap:operation soapAction="urn:getFullQuote" style="document" /><wsdl:input><soap:body use="literal" /></wsdl:input><wsdl:output><soap:body use="literal" /></wsdl:output></wsdl:operation></wsdl:binding><wsdl:binding name="PerfStockQuoteServiceSOAP12Binding" type="axis2:PerfStockQuoteServicePortType"><soap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="document" /><wsdl:operation name="placeOrder"><soap12:operation soapAction="urn:placeOrder" style="document" /><wsdl:input><soap12:body use="literal" /></wsdl:input></wsdl:operation><wsdl:operation name="getQuote"><soap12:operation soapAction="urn:getQuote" style="document" /><wsdl:input><soap12:body use="literal" /></wsdl:input><wsdl:output><soap12:body use="literal" /></wsdl:output></wsdl:operation><wsdl:operation name="getMarketActivity"><soap12:operation soapAction="urn:getMarketActivity" style="document" /><wsdl:input><soap12:body use="literal" /></wsdl:input><wsdl:output><soap12:body use="literal" /></wsdl:output></wsdl:operation><wsdl:operation name="buyStocks"><soap12:operation soapAction="urn:buyStocks" style="document" /><wsdl:input><soap12:body use="literal" /></wsdl:input><wsdl:output><soap12:body use="literal" /></wsdl:output></wsdl:operation><wsdl:operation name="getFullQuote"><soap12:operation soapAction="urn:getFullQuote" style="document" /><wsdl:input><soap12:body use="literal" /></wsdl:input><wsdl:output><soap12:body use="literal" /></wsdl:output></wsdl:operation></wsdl:binding><wsdl:binding name="PerfStockQuoteServiceHttpBinding" type="axis2:PerfStockQuoteServicePortType"><http:binding verb="POST" /><wsdl:operation name="placeOrder"><http:operation location="placeOrder" /><wsdl:input><mime:content type="text/xml" /></wsdl:input></wsdl:operation><wsdl:operation name="getQuote"><http:operation location="getQuote" /><wsdl:input><mime:content type="text/xml" /></wsdl:input><wsdl:output><mime:content type="text/xml" /></wsdl:output></wsdl:operation><wsdl:operation name="getMarketActivity"><http:operation location="getMarketActivity" /><wsdl:input><mime:content type="text/xml" /></wsdl:input><wsdl:output><mime:content type="text/xml" /></wsdl:output></wsdl:operation><wsdl:operation name="buyStocks"><http:operation location="buyStocks" /><wsdl:input><mime:content type="text/xml" /></wsdl:input><wsdl:output><mime:content type="text/xml" /></wsdl:output></wsdl:operation><wsdl:operation name="getFullQuote"><http:operation location="getFullQuote" /><wsdl:input><mime:content type="text/xml" /></wsdl:input><wsdl:output><mime:content type="text/xml" /></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="PerfStockQuoteService"><wsdl:port name="PerfStockQuoteServiceSOAP11port_https" binding="axis2:PerfStockQuoteServiceSOAP11Binding"><soap:address location="https://asankha:9002/soap/PerfStockQuoteService" /></wsdl:port><wsdl:port name="PerfStockQuoteServiceSOAP11port_http1" binding="axis2:PerfStockQuoteServiceSOAP11Binding"><soap:address location="http://asankha:9000/soap/PerfStockQuoteService" /></wsdl:port><wsdl:port name="PerfStockQuoteServiceSOAP12port_https" binding="axis2:PerfStockQuoteServiceSOAP12Binding"><soap12:address location="https://asankha:9002/soap/PerfStockQuoteService" /></wsdl:port><wsdl:port name="PerfStockQuoteServiceSOAP12port_http1" binding="axis2:PerfStockQuoteServiceSOAP12Binding"><soap12:address location="http://asankha:9000/soap/PerfStockQuoteService" /></wsdl:port><wsdl:port name="PerfStockQuoteServiceHttpport" binding="axis2:PerfStockQuoteServiceHttpBinding"><http:address location="https://asankha:9002/soap/PerfStockQuoteService" /></wsdl:port><wsdl:port name="PerfStockQuoteServiceHttpport1" binding="axis2:PerfStockQuoteServiceHttpBinding"><http:address location="http://asankha:9000/soap/PerfStockQuoteService" /></wsdl:port></wsdl:service></wsdl:definitions></syn:publishWSDL></syn:proxy><syn:endpoint name="simulator"><syn:address uri="http://10.100.1.44:8000/Simulator/PerfStockService"><syn:enableAddressing /></syn:address></syn:endpoint><syn:sequence name="main"><syn:log separator=","><syn:property name="MSG" value="*** MAIN SEQUENCE ***" /></syn:log><syn:drop /></syn:sequence><syn:sequence name="fault"><syn:log separator=","><syn:property name="MSG" value="*** FAULT ***" /></syn:log></syn:sequence></syn:definitions>
