qa/component-test-framework/test-resources/request-xmls/StockQuoteRequest_with_header.xml

<?xml version='1.0' encoding='UTF-8'?>
  <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
      <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
         <wsa:To>http://localhost:9765/services/SimpleStockQuoteService</wsa:To>
         <wsa:Action>urn:getQuote</wsa:Action>
      </soapenv:Header>
     <soapenv:Body>
        <m0:getQuote xmlns:m0="http://services.samples">
           <m0:request>
              <m0:symbol>IBM</m0:symbol>
           </m0:request>
        </m0:getQuote>
     </soapenv:Body>
  </soapenv:Envelope>
