qa/qa-artifacts/esb/esb450/mediators/log/log_levels/request.xml

<?xml version='1.0' encoding='UTF-8'?>
   <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
      <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
         <wsa:To>http://localhost:9000/services/SimpleStockQuoteService</wsa:To>
         <wsa:MessageID>urn:uuid:b68b1e33-292f-4b6f-ba0f-d4228e9b8705</wsa:MessageID>
         <wsa:Action>urn:getQuote</wsa:Action>
         <wsa:version>20</wsa:version>
         <wsa:datetime>Wed Dec 23 08:56:00 CST 2009</wsa:datetime>
         <wsa:storeNumber>110</wsa:storeNumber>
         <wsa:messageID>9823749238792342</wsa:messageID>
      </soapenv:Header>
      <soapenv:Body>
         <m0:getQuote xmlns:m0="http://services.samples">
            <m0:request>
               <m0:symbol>IBM</m0:symbol>
            </m0:request>
         </m0:getQuote>
      </soapenv:Body>
   </soapenv:Envelope>
